In [3]:
import pandas as pd
s = pd.Series([44,38,76,89,55,19],dtype='int32')
type(s)

pandas.core.series.Series

In [5]:
print(s)

0    44
1    38
2    76
3    89
4    55
5    19
dtype: int32

In [37]:
s1 = pd.Series([94,38,76,89,55,19],index=["Nitesh" , "Harshit","Suryansh","Pragya","Nakul","Shreyansh"])

In [39]:
s1

Nitesh       94
Harshit      38
Suryansh     76
Pragya       89
Nakul        55
Shreyansh    19
dtype: int64

In [41]:
s1["Nitesh"]

94

In [7]:
data = {
    "name": ["Nitesh", "Pragya", "Achint"],
    "age": [19, 18, 17],
    "city": ["Bhilai", "Kachandur", "Gunderdehi"]
}

df = pd.DataFrame(data)
df

     name  age        city
0  Nitesh   19      Bhilai
1  Pragya   18   Kachandur
2  Achint   17  Gunderdehi

In [55]:
pd.DataFrame(data)

     name  age        city
0  Nitesh   19      Bhilai
1  Pragya   18   Kachandur
2  Achint   17  Gunderdehi

In [63]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [65]:
df.columns

Index(['name', 'age', 'city'], dtype='object')